let name = prompt("Введите ваше имя:");
let age = prompt("Введите ваш возраст:");
let city = prompt("Введите ваш город:");

if(age >=18){
    alert(`Привет, ${name}! Вам ${age} лет, вы из города ${city}. Добро пожаловать на наш сайт!`);
    console.log(`Привет, ${name}! Вам ${age} лет, вы из города ${city}. Добро пожаловать на наш сайт!`);
}else{
    alert(`Привет, ${name}! К сожалению, вам меньше 18 лет, и доступ к сайту ограничен.`);
    console.log(`Привет, ${name}! К сожалению, вам меньше 18 лет, и доступ к сайту ограничен.`);
}
